//#include <iostream>
//
//using namespace std;
//
//int main() {
//
//	// 배열변수
//	int num[5]; // num[];은 초기화되지않아 컴파일 에러가남.
//	num[0] = 10;
//	num[1] = 20;
//	num[2] = 30;
//	num[3] = 40;
//	num[4] = 50;
//	// num[5] = 60; // 오버런 버퍼로 런타임에러남.
//
//	int arr1[10] = { 1,2,3,4,5,6,7,8,9,10 }; // 한번에 주입
//	int arr2[] = { 1,2,3,4 };
//
//	//for (int i = 0; i < 5; i++) {
//	//	cout << arr1[i] << " ";
//	//}
//	
//	/*
//	2차원 배열
//	*/
//
//	int matrix[2][3] = { //[a][b] = a층의 b번째 원소
//		{1,2,3}, // [0번째 인덱스배열][1번째 인덱스배열]
//		{4,5,6}
//	};
//
//	for (int i = 0; i < 2; i++) {
//		for (int j = 0; j < 3; j++) {
//			cout << matrix[i][j] << " ";
//		}
//		cout << endl; // 줄바꿈
//	}
//
//	int a[2][2] = 
//	{ 
//		{1,2}, // [0번째 인덱스배열][1번째 인덱스배열]
//		{4,5} 
//	};
//
//	int b[2][2] = {
//		{100, 200},
//		{400, 500}
//	};
//
//	int result[2][2]; // 최종적으로 담을 배열
//
//	const int ROWS = 2;
//	const int COLS = 3;
//	
//	for (int i = 0; i < ROWS; i++) 
//	{ //가로로 돌려서
//		for (int j = 0; j < COLS; j++) 
//		{
//			result[i][j] = a[i][j] + b[i][j]; // a[0][0] + b[0][0] = 1 + 100 = 101
//			cout << result[i][j] << " ";
//		}
//	}
//
//
//
//	return 0;
//}